Table of Contents
 Class ResultPoint
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
Point of results
[Obsolete]
public class ResultPoint
Inheritance
object
ResultPoint
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Id
Id of Point
public int Id { get; set; }
Property Value
int
 Point
Location of Point
public Point3D Point { get; set; }
Property Value
Point3D
 Edit this page